Revit 2027 API
ExternalCommandData.Application Property
 Retrieves an object that represents the current Application for external command.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public UIApplication Application { get; set; }
Public Property Application As UIApplication
	Get
	Set
public:
property UIApplication^ Application {
	UIApplication^ get ();
	void set (UIApplication^ value);
}
member Application : UIApplication with get, set
Property Value
UIApplication
See Also
Reference
ExternalCommandData Class
Autodesk.Revit.UI Namespace